RecordCommonInputInvoiceData = [
    [['1','1'],'管理部门','5%','3111','薪资福利-福利费'],
    [['1','2'],'管理部门','5%','3112','薪资福利-劳务费'],
    [['2','1'],'管理部门','5%','3121','行政支出-招待费'],
    [['2','2'],'管理部门','5%','3122','行政支出-办公费'],
    [['2','3'],'管理部门','5%','3123','行政支出-快递费'],
    [['2','4'],'管理部门','5%','3124','行政支出-通讯费'],
    [['2','5'],'管理部门','5%','3125','行政支出-维修费'],
    [['2','6'],'管理部门','5%','3126','行政支出-财产保险费'],
    [['2','7'],'管理部门','5%','3127','行政支出-设备租赁费'],
    [['2','8'],'管理部门','5%','3128','行政支出-银行费用'],
    [['3','1'],'管理部门','5%','3131','差旅交通-差旅费'],
    [['3','2'],'管理部门','5%','3132','差旅交通-交通费'],
    [['3','3'],'管理部门','5%','3133','差旅交通-汽油费'],
    [['3','4'],'管理部门','5%','3134','差旅交通-路桥费'],
    [['3','5'],'管理部门','5%','3135','差旅交通-汽车维修费'],
    [['3','6'],'管理部门','5%','3136','差旅交通-汽车保险'],
    [['3','7'],'管理部门','5%','3137','差旅交通-物流费'],
    [['4','1'],'管理部门','5%','3141','房租物业-房租费'],
    [['4','2'],'管理部门','5%','3142','房租物业-物业费'],
    [['4','3'],'管理部门','5%','3143','房租物业-水费'],
    [['4','4'],'管理部门','5%','3144','房租物业-电费'],
    [['4','5'],'管理部门','5%','3145','房租物业-仓储费'],
    [['4','6'],'管理部门','5%','3146','房租物业-装修费'],
    [['5','1'],'管理部门','5%','3151','经营支出-广告费'],
    [['5','2'],'管理部门','5%','3152','经营支出-宣传费'],
    [['5','3'],'管理部门','5%','3153','经营支出-研发费'],
    [['5','4'],'管理部门','5%','3154','经营支出-会议费'],
    [['5','5'],'管理部门','5%','3155','经营支出-服务费'],
    [['5','6'],'管理部门','5%','3156','经营支出-咨询费'],
    [['5','7'],'管理部门','5%','3157','经营支出-认证费'],
    [['5','8'],'管理部门','5%','3158','经营支出-专利费'],
    [['5','9'],'管理部门','5%','3159','经营支出-工会经费'],
    [['5','10'],'管理部门','5%','31510','经营支出-其他'],
    [['6','1'],'管理部门','5%','3161','其他收支-行政罚款'],
    [['6','2'],'管理部门','5%','3162','其他收支-税务滞纳金'],
    [['7','1'],'管理部门','5%','3171','税费-印花税'],
    [['7','2'],'管理部门','5%','3172','税费-残保金'],
    [['7','3'],'管理部门','5%','3173','税费-减免税款'],
    [['8','1'],'管理部门','5%','3181','采购-原材料'],
    [['8','2'],'管理部门','5%','3182','采购-商品产品']
]

def test():
    obdict = ''
    for lineList in RecordCommonInputInvoiceData:
        ss = lineList[4].split('-')[1]
        obdict = obdict + ss + ','
    print(obdict)
test()