#生成凭证测试数据

#对应所有收入类别的公共部分 [记账日期，交易账户，对方信息]
RecordIncomePublicData = [
    ['1','现金','内部代表'],
    ['1','招商银行','内部代表'],
    ['1','羊羊羊微信','内部代表'],
    ['1','羊羊羊支付宝','内部代表'],
    ['1','现金','内部代表'],
    ['1','招商银行','内部代表'],
    ['1','羊羊羊微信','内部代表'],
    ['1','羊羊羊支付宝','内部代表']
]

#所有收入类别  测试数据共计8条
RecordIncomeItemsData = [
    ['1',['1','1'],'111','现金-内部代表-利息收入-利息收入 111'],
    ['1',['2','1'],'121','招商银行-内部代表-资金往来-回收借出资金(收入) 121'],
    ['1',['2','2'],'122','羊羊羊微信-内部代表-资金往来-收到临时借入款(收入) 122'],
    ['1',['3','1'],'131','羊羊羊支付宝-内部代表-投资&融资-收回投资利息(收入) 131'],
    ['1',['3','2'],'132','现金-内部代表-投资&融资-收回投资本金(收入) 132'],
    ['1',['3','3'],'133','招商银行-内部代表-投资&融资-收到投资款 133'],
    ['1',['3','4'],'134','羊羊羊微信-内部代表-投资&融资-银行贷款(收入) 134'],
    ['1',['4','1'],'141','羊羊羊支付宝-内部代表-应收账款-应收账款 141']
]

#所有类别的收入记录生成对应凭证
IncomeVoucherData = [
    [{'摘要':'2017年8月现金收款','科目':'100101—RMB','借':'111.00','贷':'-'},
     {'摘要':'现金-内部代表-利息收入-利息收入 111','科目':'560301—利息费用','借':'-111.00','贷':'-'},
     {'借':'-','贷':'-'}],
    [{'摘要':'2017年8月银行收款','科目':'100201—银行','借':'121.00','贷':'-'},
     {'摘要':'招商银行-内部代表-资金往来-回收借出资金(收入) 121','科目':'12210101—临时借出资金','借':'-','贷':'121.00'},
     {'借':'121.00','贷':'121.00'}],
    [{'摘要':'2017年8月微信收款','科目':'100221—微信','借':'122.00','贷':'-'},
     {'摘要':'羊羊羊微信-内部代表-资金往来-收到临时借入款(收入) 122','科目':'22410101—临时借入款','借':'-','贷':'122.00'},
     {'借':'122.00','贷':'122.00'}],
    [{'摘要':'2017年8月支付宝收款','科目':'100211—支付宝','借':'131.00','贷':'-'},
     {'摘要':'羊羊羊支付宝-内部代表-投资&融资-收回投资利息(收入) 131','科目':'511101—投资收益','借':'-','贷':'131.00'},
     {'借':'131.00','贷':'131.00'}],
    [{'摘要':'2017年8月现金收款','科目':'100101—RMB','借':'132.00','贷':'-'},
     {'摘要':'现金-内部代表-投资&融资-收回投资本金(收入) 132','科目':'151101—投资名称','借':'-','贷':'132.00'},
     {'借':'132.00','贷':'132.00'}],
    [{'摘要':'2017年8月银行收款','科目':'100201—银行','借':'133.00','贷':'-'},
     {'摘要':'招商银行-内部代表-投资&融资-收到投资款 133','科目':'300101—股东名称','借':'-','贷':'133.00'},
     {'借':'133.00','贷':'133.00'}],
    [{'摘要':'2017年8月微信收款','科目':'100221—微信','借':'134.00','贷':'-'},
     {'摘要':'羊羊羊微信-内部代表-投资&融资-银行贷款(收入) 134','科目':'200101—银行贷款','借':'-','贷':'134.00'},
     {'借':'134.00','贷':'134.00'}],
    [{'摘要':'2017年8月支付宝收款','科目':'100211—支付宝','借':'141.00','贷':'-'},
     {'摘要':'羊羊羊支付宝-内部代表-应收账款-应收账款 141','科目':'112201—单位','借':'-','贷':'141.00'},
     {'借':'141.00','贷':'141.00'}],
    [{'摘要':'行政支出-银行费用','科目':'560302—手续费用','借':'211.00','贷':'-'},
     {'摘要':'2017年8月现金支付','科目':'100101—RMB','借':'-','贷':'211.00'},
     {'借':'211.00','贷':'211.00'}],
    [{'摘要':'资金往来-临时借出资金','科目':'12210101—临时借出资金','借':'221.00','贷':'-'},
     {'摘要':'2017年8月银行支付','科目':'100201—银行','借':'-','贷':'221.00'},
     {'借':'221.00','贷':'221.00'}]
]

#所有类别支出的表头，共计18条
RecordOutcomePublicData = [
    ['1','现金','内部代表'],
    ['1','招商银行','内部代表'],
    ['1','羊羊羊微信','内部代表'],
    ['1','羊羊羊支付宝','内部代表'],
    ['1','现金','内部代表'],
    ['1','招商银行','内部代表'],
    ['1','羊羊羊微信','内部代表'],
    ['1','羊羊羊支付宝','内部代表'],
    ['1','现金','内部代表'],
    ['1','招商银行','内部代表'],
    ['1','羊羊羊微信','内部代表'],
    ['1','羊羊羊支付宝','内部代表'],
    ['1','现金','内部代表'],
    ['1','招商银行','内部代表'],
    ['1','羊羊羊微信','内部代表'],
    ['1','羊羊羊支付宝','内部代表'],
    ['1','现金','内部代表'],
    ['1','招商银行','内部代表']
]

#记所有类别支出测试数据 金额共计：4,359.00元 支出记录：18条
RecordOutputItemsData = [
    ['1',['1','1'],'211','现金-内部代表-行政支出-银行费用 211'],
    ['1',['2','1'],'221','招商银行-内部代表-资金往来-临时借出资金 221'],
    ['1',['2','2'],'222','羊羊羊微信-内部代表-资金往来-归还临时借入 222'],
    ['1',['3','1'],'231','羊羊羊支付宝-内部代表-投资&融资-对外投资款 231'],
    ['1',['3','2'],'232','现金-内部代表-投资&融资-归还银行贷款 232'],
    ['1',['3','3'],'233','招商银行-内部代表-投资&融资-贷款利息 233'],
    ['1',['4','1'],'241','羊羊羊微信-内部代表-应付职工薪酬-应付工资奖金 241'],
    ['1',['4','2'],'242','羊羊羊支付宝-内部代表-应付职工薪酬-应付社保费 242'],
    ['1',['4','3'],'243','现金-内部代表-应付职工薪酬-应付公积金 243'],
    ['1',['4','4'],'244','招商银行-内部代表-应付职工薪酬-应付劳务费 244'],
    ['1',['5','1'],'251','羊羊羊微信-内部代表-应交税费-应交增值税 251'],
    ['1',['5','2'],'252','羊羊羊支付宝-内部代表-应交税费-应交城建税 252'],
    ['1',['5','3'],'253','现金-内部代表-应交税费-应交教育费附加 253'],
    ['1',['5','4'],'254','招商银行-内部代表-应交税费-应交地方教育附加 254'],
    ['1',['5','5'],'255','羊羊羊微信-内部代表-应交税费-应交个税 255'],
    ['1',['5','6'],'256','羊羊羊支付宝-内部代表-应交税费-应交印花税 256'],
    ['1',['5','7'],'257','现金-内部代表-应交税费-应交所得税 257'],
    ['1',['6','1'],'261','招商银行-内部代表-应付账款-应付账款 261']
]

#记所有支出类别对应的凭证
OutcomeVoucherData = [
    [{'摘要':'现金-内部代表-行政支出-银行费用 211','科目':'560302—手续费用','借':'211.00','贷':'-'},
     {'摘要':'2017年8月现金支付','科目':'100101—RMB','借':'-','贷':'211.00'},
     {'借':'211.00','贷':'211.00'}]
]

#账户互转：7 记账户互转测试数据  共计12笔
RecordTransferData = [
    ['1','招商银行','现金','711','招商银行-现金 711'],
    ['1','招商银行','羊羊羊微信','712','招商银行-羊羊羊微信 712'],
    ['1','招商银行','羊羊羊支付宝','713','招商银行-羊羊羊支付宝 713'],
    ['1','现金','招商银行','714','现金-招商银行 714'],
    ['1','现金','羊羊羊微信','715','现金-羊羊羊微信 715'],
    ['1','现金','羊羊羊支付宝','716','现金-羊羊羊支付宝 716'],
    ['1','羊羊羊微信','现金','717','羊羊羊微信-现金 717'],
    ['1','羊羊羊微信','招商银行','718','羊羊羊微信-招商银行 718'],
    ['1','羊羊羊微信','羊羊羊支付宝','719','羊羊羊微信-羊羊羊支付宝 719'],
    ['1','羊羊羊支付宝','现金','720','羊羊羊支付宝-现金 720'],
    ['1','羊羊羊支付宝','招商银行','721','羊羊羊支付宝-招商银行 721'],
    ['1','羊羊羊支付宝','羊羊羊微信','722','羊羊羊支付宝-羊羊羊微信 722']
]

#收票-专票 生成凭证分录数据
SpecialInputInvoiceVoucherData = [
    [{'摘要':'专票-内部代表-薪资福利-福利费-管理部门-有形动产租赁 3211','科目':['56020104','福利费'],'借':'3,117.48','贷':'-'},
     {'摘要':'2017年8月 收票支出','科目':['122103','待抵扣进项税'],'借':'93.52','贷':'-'},
     {'摘要':'2017年8月 收票支出','科目':['22410101','临时借入款'],'借':'-','贷':'3,211.00'},
     {'借':'3,211.00','贷':'3,211.00'}],
    [{'摘要':'专票-内部代表-行政支出-招待费-管理部门-运输服务 3221','科目':['56020201','招待费'],'借':'3,127.18','贷':'-'},
     {'摘要':'2017年8月 收票支出','科目':['122103','待抵扣进项税'],'借':'93.82','贷':'-'},
     {'摘要':'2017年8月 收票支出','科目':['22410101','临时借入款'],'借':'-','贷':'3,221.00'},
     {'借':'3,221.00','贷':'3,221.00'}],
    [{'摘要':'专票-内部代表-行政支出-办公费-管理部门-电信服务 3222','科目':['56020202','办公费'],'借':'3,128.16','贷':'-'},
     {'摘要':'2017年8月 收票支出','科目':['122103','待抵扣进项税'],'借':'93.8','贷':'-'},
     {'摘要':'2017年8月 收票支出','科目':['22410101','临时借入款'],'借':'-','贷':'3,222.00'},
     {'借':'3,222.00','贷':'3,222.00'}],
    [{'摘要':'专票-内部代表-行政支出-快递费-管理部门-建筑安装服务 3223','科目':['56020203','快递费'],'借':'3,129.13','贷':'-'},
     {'摘要':'2017年8月 收票支出','科目':['122103','待抵扣进项税'],'借':'93.87','贷':'-'},
     {'摘要':'2017年8月 收票支出','科目':['22410101','临时借入款'],'借':'-','贷':'3,223.00'},
     {'借':'3,223.00','贷':'3,223.00'}],
    [{'摘要':'专票-内部代表-行政支出-通讯费-管理部门-金融保险服务 3224','科目':['56020204','通讯费'],'借':'3,130.10','贷':'-'},
     {'摘要':'2017年8月 收票支出','科目':['122103','待抵扣进项税'],'借':'93.90','贷':'-'},
     {'摘要':'2017年8月 收票支出','科目':['22410101','临时借入款'],'借':'-','贷':'3,225.00'},
     {'借':'3,225.00','贷':'3,225.00'}],
    [{'摘要':'专票-内部代表-行政支出-维修费-管理部门-其他 3225','科目':['56020205','维修费'],'借':'3,131.07','贷':'-'},
     {'摘要':'2017年8月 收票支出','科目':['122103','待抵扣进项税'],'借':'93.93','贷':'-'},
     {'摘要':'2017年8月 收票支出','科目':['22410101','临时借入款'],'借':'-','贷':'3,225.00'},
     {'借':'3,225.00','贷':'3,225.00'}],

    [{'摘要':'专票-内部代表-薪资福利-福利费-管理部门-有形动产租赁 3211','科目':['56020104','福利费'],'借':'3,117.48','贷':'-'},
     {'摘要':'2017年8月 收票支出','科目':['122103','待抵扣进项税'],'借':'93.52','贷':'-'},
     {'摘要':'2017年8月 收票支出','科目':['22410101','临时借入款'],'借':'-','贷':'3,211.00'},
     {'借':'3,211.00','贷':'3,211.00'}],
    [{'摘要':'专票-内部代表-薪资福利-福利费-管理部门-有形动产租赁 3211','科目':['56020104','福利费'],'借':'3,117.48','贷':'-'},
     {'摘要':'2017年8月 收票支出','科目':['122103','待抵扣进项税'],'借':'93.52','贷':'-'},
     {'摘要':'2017年8月 收票支出','科目':['22410101','临时借入款'],'借':'-','贷':'3,211.00'},
     {'借':'3,211.00','贷':'3,211.00'}],
    [{'摘要':'专票-内部代表-薪资福利-福利费-管理部门-有形动产租赁 3211','科目':['56020104','福利费'],'借':'3,117.48','贷':'-'},
     {'摘要':'2017年8月 收票支出','科目':['122103','待抵扣进项税'],'借':'93.52','贷':'-'},
     {'摘要':'2017年8月 收票支出','科目':['22410101','临时借入款'],'借':'-','贷':'3,211.00'},
     {'借':'3,211.00','贷':'3,211.00'}],
    [{'摘要':'专票-内部代表-薪资福利-福利费-管理部门-有形动产租赁 3211','科目':['56020104','福利费'],'借':'3,117.48','贷':'-'},
     {'摘要':'2017年8月 收票支出','科目':['122103','待抵扣进项税'],'借':'93.52','贷':'-'},
     {'摘要':'2017年8月 收票支出','科目':['22410101','临时借入款'],'借':'-','贷':'3,211.00'},
     {'借':'3,211.00','贷':'3,211.00'}],
]

#记固定资产测试数据:普票-管理部门-内部代表
RecordFixedassetsCommInvData = [
    [{'购买日期':'1','发票类型':'普票','部门性质':'管理部门','对方信息':'内部代表','名称':'笔记本电脑-11','分类':'电子设备','数量':'1','总额':'5111','备注':'固定-普票-管理部门-内部代表-电子设备-5111'}],
    [{'购买日期':'1','发票类型':'普票','部门性质':'管理部门','对方信息':'内部代表','名称':'别墅-11','分类':'房屋、建筑','数量':'1','总额':'5112','备注':'固定-普票-管理部门-内部代表-房屋、建筑-5112'}],
    [{'购买日期':'1','发票类型':'普票','部门性质':'管理部门','对方信息':'内部代表','名称':'桌子-11','分类':'工器具、家具','数量':'1','总额':'5113','备注':'固定-普票-管理部门-内部代表-工器具、家具-513'}],
    [{'购买日期':'1','发票类型':'普票','部门性质':'管理部门','对方信息':'内部代表','名称':'自行车-11','分类':'机械设备、运输工具','数量':'1','总额':'5114','备注':'固定-普票-管理部门-内部代表-机械设备、运输工具-5114'}],
    [{'购买日期':'1','发票类型':'普票','部门性质':'管理部门','对方信息':'内部代表','名称':'汽车-11','分类':'交通工具','数量':'1','总额':'5115','备注':'固定-普票-管理部门-内部代表-交通工具-5115'}],
    [{'购买日期':'1','发票类型':'普票','部门性质':'销售部门','对方信息':'内部代表','名称':'笔记本电脑-12','分类':'电子设备','数量':'1','总额':'5121','备注':'固定-普票-销售部门-内部代表-电子设备-5121'}],
    [{'购买日期':'1','发票类型':'普票','部门性质':'销售部门','对方信息':'内部代表','名称':'别墅-12','分类':'房屋、建筑','数量':'1','总额':'5122','备注':'固定-普票-销售部门-内部代表-房屋、建筑-5122'}],
    [{'购买日期':'1','发票类型':'普票','部门性质':'销售部门','对方信息':'内部代表','名称':'桌子-12','分类':'工器具、家具','数量':'1','总额':'5123','备注':'固定-普票-销售部门-内部代表-工器具、家具-5123'}],
    [{'购买日期':'1','发票类型':'普票','部门性质':'销售部门','对方信息':'内部代表','名称':'自行车-12','分类':'机械设备、运输工具','数量':'1','总额':'5124','备注':'固定-普票-销售部门-内部代表-机械设备、运输工具-5124'}],
    [{'购买日期':'1','发票类型':'普票','部门性质':'销售部门','对方信息':'内部代表','名称':'汽车-12','分类':'交通工具','数量':'1','总额':'5125','备注':'固定-普票-销售部门-内部代表-交通工具-5125'}]
    
]

#记固定资产测试数据:专票-管理部门-内部代表
# RecordFixedassetsSpecInvData = [
#     [{'购买日期':'1','发票类型':'专票','部门性质':'管理部门','对方信息':'内部代表','税率'：'1.5%','进项税类别':'固定资产','名称':'笔记本电脑-21','分类':'电子设备','数量':'1','总额':'5211','备注':'固定-专票-管理部门-内部代表-电子设备-5211'}],
#     [{'购买日期':'1','发票类型':'专票','部门性质':'管理部门','对方信息':'内部代表','税率'：'1.5%','进项税类别':'固定资产','名称':'别墅-21','分类':'房屋、建筑','数量':'1','总额':'5212','备注':'固定-专票-管理部门-内部代表-房屋、建筑-5212'}],
#     [{'购买日期':'1','发票类型':'专票','部门性质':'管理部门','对方信息':'内部代表','税率'：'1.5%','进项税类别':'固定资产','名称':'桌子-21','分类':'工器具、家具','数量':'1','总额':'5213','备注':'固定-专票-管理部门-内部代表-工器具、家具-5213'}],
#     [{'购买日期':'1','发票类型':'专票','部门性质':'管理部门','对方信息':'内部代表','税率'：'1.5%','进项税类别':'固定资产','名称':'自行车-21','分类':'机械设备、运输工具','数量':'1','总额':'5214','备注':'固定-专票-管理部门-内部代表-机械设备、运输工具-5214'}],
#     [{'购买日期':'1','发票类型':'专票','部门性质':'管理部门','对方信息':'内部代表','税率'：'1.5%','进项税类别':'固定资产','名称':'汽车-21','分类':'交通工具','数量':'1','总额':'5215','备注':'固定-专票-管理部门-内部代表-交通工具-5215'}],
#     [{'购买日期':'1','发票类型':'专票','部门性质':'销售部门','对方信息':'内部代表','税率'：'1.5%','进项税类别':'固定资产','名称':'笔记本电脑-22','分类':'电子设备','数量':'1','总额':'5221','备注':'固定-专票-销售部门-内部代表-电子设备-5221'}],
#     [{'购买日期':'1','发票类型':'专票','部门性质':'销售部门','对方信息':'内部代表','税率'：'1.5%','进项税类别':'固定资产','名称':'别墅-22','分类':'房屋、建筑','数量':'1','总额':'5222','备注':'固定-专票-销售部门-内部代表-房屋、建筑-5222'}],
#     [{'购买日期':'1','发票类型':'专票','部门性质':'销售部门','对方信息':'内部代表','税率'：'1.5%','进项税类别':'固定资产','名称':'桌子-22','分类':'工器具、家具','数量':'1','总额':'5223','备注':'固定-专票-销售部门-内部代表-工器具、家具-5223'}],
#     [{'购买日期':'1','发票类型':'专票','部门性质':'销售部门','对方信息':'内部代表','税率'：'1.5%','进项税类别':'固定资产','名称':'自行车-22','分类':'机械设备、运输工具','数量':'1','总额':'5224','备注':'固定-专票-销售部门-内部代表-机械设备、运输工具-5224'}],
#     [{'购买日期':'1','发票类型':'专票','部门性质':'销售部门','对方信息':'内部代表','税率'：'1.5%','进项税类别':'固定资产','名称':'汽车-22','分类':'交通工具','数量':'1','总额':'5225','备注':'固定-专票-销售部门-内部代表-交通工具-5225'}]
    
# ]