#生成凭证测试数据

#对应所有收入类别的公共部分 [记账日期，交易账户，对方信息]
RecordIncomePublicData = [
    ['1','现金','内部代表'],
    ['1','招商银行','内部代表'],
    ['1','羊羊羊微信','内部代表'],
    ['1','羊羊羊支付宝','内部代表'],
    ['1','现金','内部代表'],
    ['1','招商银行','内部代表'],
    ['1','羊羊羊微信','内部代表'],
    ['1','羊羊羊支付宝','内部代表']
]

#所有收入类别  测试数据共计8条
RecordIncomeItemsData = [
    ['1',['1','1'],'111','现金-内部代表-利息收入-利息收入 111'],
    ['1',['2','1'],'121','招商银行-内部代表-资金往来-回收借出资金(收入) 121'],
    ['1',['2','2'],'122','羊羊羊微信-内部代表-资金往来-收到临时借入款(收入) 122'],
    ['1',['3','1'],'131','羊羊羊支付宝-内部代表-投资&融资-收回投资利息(收入) 131'],
    ['1',['3','2'],'132','现金-内部代表-投资&融资-收回投资本金(收入) 132'],
    ['1',['3','3'],'133','招商银行-内部代表-投资&融资-收到投资款 133'],
    ['1',['3','4'],'134','羊羊羊微信-内部代表-投资&融资-银行贷款(收入) 134'],
    ['1',['4','1'],'141','羊羊羊支付宝-内部代表-应收账款-应收账款 141']
]

#所有类别的收入记录生成对应凭证
IncomeVoucherData = [
    [['2017年8月现金收款','100101—RMB','111.00','-'],['现金-内部代表-利息收入-利息收入 111','560301—利息费用','-111.00','-'],['-','-']],
    [['2017年8月银行收款','100201—银行','121.00','-'],['招商银行-内部代表-资金往来-回收借出资金(收入) 121','12210101—临时借出资金','-','121.00'],['121.00','121.00']],
    [['2017年8月微信收款','100221—微信','122.00','-'],['羊羊羊微信-内部代表-资金往来-收到临时借入款(收入) 122','22410101—临时借入款','-','122.00'],['122.00','122.00']],
    [['2017年8月支付宝收款','100211—支付宝','131.00','-'],['羊羊羊支付宝-内部代表-投资&融资-收回投资利息(收入) 131','511101—投资收益','-','131.00'],['131.00','131.00']],
    [['2017年8月现金收款','100101—RMB','132.00','-'],['现金-内部代表-投资&融资-收回投资本金(收入) 132','151101—投资名称','-','-132'],['132','132']],
    [['2017年8月银行收款','100201—银行','133.00','-'],['招商银行-内部代表-投资&融资-收到投资款 133','300101—股东名称','-','133.00'],['133.00','133.00']],
    [['2017年8月微信收款','100221—微信','134.00','-'],['羊羊羊微信-内部代表-投资&融资-银行贷款(收入) 134','200101—银行贷款','-','134.00'],['134.00','134.00']],
    [['2017年8月支付宝收款','100211—支付宝','141.00','-'],['羊羊羊支付宝-内部代表-应收账款-应收账款 141','112201—单位','-','141.00'],['141.00','141.00']]
]

RecordOutcomePublicData = [
    ['1','现金','内部代表']
]

RecordOutputItemsData = [
    ['1',['1','1'],'211','现金-内部代表-行政支出-银行费用 211']
]

RecordTransferData = [
    ['1','招商银行','现金','711','招商银行-现金 711']
]