#账户互转：7
#记账户互转测试数据  共计15笔
RecordTransferData = [
    ['1','招商银行','现金','711','招商银行-现金711'],
    ['1','招商银行','现金','712','招商银行-现金712'],
    ['1','招商银行','现金','713','招商银行-现金713'],
    ['1','招商银行','现金','714','招商银行-现金714'],
    ['1','招商银行','现金','715','招商银行-现金715'],
    ['1','招商银行','现金','716','招商银行-现金716'],
    ['1','招商银行','现金','717','招商银行-现金717'],
    ['1','招商银行','现金','718','招商银行-现金718'],
    ['1','招商银行','现金','719','招商银行-现金719'],
    ['1','招商银行','现金','720','招商银行-现金720'],
    ['1','招商银行','现金','721','招商银行-现金721'],
    ['1','招商银行','现金','722','招商银行-现金722'],
    ['1','招商银行','现金','723','招商银行-现金723'],
    ['1','招商银行','现金','724','招商银行-现金724'],
    ['1','招商银行','现金','725','招商银行-现金725']
]