#收入类别
incomeCategory = [
    ['1','利息收入'],
    ['2','回收借出资金(收入)'],
    ['2','收到临时借入款(收入)'],
    ['3','收回投资利息(收入)'],
    ['3','收回投资本金(收入)'],
    ['3','收到投资款'],
    ['3','银行贷款(收入)'],
    ['4','应收账款']
]

#收入金额共计：1,025.00元 收入记录：8条
recordIncomeData = [
    ['1',['1','利息收入'],'111','利息收入'],
    ['1',['2','回收借出资金(收入)'],'121','资金往来'],
    ['1',['2','收到临时借入款(收入)'],'122','资金往来'],
    ['1',['3','收回投资利息(收入)'],'131','投资&融资'],
    ['1',['3','收回投资本金(收入)'],'132','投资&融资'],
    ['1',['3','收到投资款'],'133','投资&融资'],
    ['1',['3','银行贷款(收入)'],'134','投资&融资'],
    ['1',['4','应收账款'],'141','应收账款']
]

#所有收入类别对应的凭证分录
outcomeVoucherFirst = [
    ['560302—手续费用'],
    ['12210101—临时借出资金'],
    ['22410101—临时借入款'],
    ['151101—投资名称'],
    ['200101—银行贷款'],
    ['560301—利息费用'],
    ['221101—工资奖金'],
    ['22410103—应付社保'],
    ['22410104—应付公积金'],
    ['22410101—临时借入款'],
    ['22210106—销项税额'],
    ['222108—应交城市维护建设税'],
    ['222113—教育费附加'],
    ['222114—地方教育费附加'],
    ['222112—应交个人所得税'],
    ['222118—应交印花税'],
    ['222106—应交所得税'],
    ['220201—单位']

]