#支出类别
outcomeCategory = [
    ['1','银行费用'],
    ['2','临时借出资金'],
    ['2','归还临时借入'],
    ['3','对外投资款'],
    ['3','归还银行贷款'],
    ['3','贷款利息'],
    ['4','应付工资奖金'],
    ['4','应付社保费'],
    ['4','应付公积金'],
    ['4','应付劳务费'],
    ['5','应交增值税'],
    ['5','应交城建税'],
    ['5','应交教育费附加'],
    ['5','应交地方教育附加'],
    ['5','应交个税'],
    ['5','应交印花税'],
    ['5','应交所得税'],
    ['6','应付账款']
]

#支出金额共计：4,359.00元 支出记录：18条
recordOutcomeData = [
    ['1',['1','银行费用'],'211','行政支出'],
    ['1',['2','临时借出资金'],'221','资金往来'],
    ['1',['2','归还临时借入'],'222','资金往来'],
    ['1',['3','对外投资款'],'231','投资&融资'],
    ['1',['3','归还银行贷款'],'232','投资&融资'],
    ['1',['3','贷款利息'],'233','投资&融资'],
    ['1',['4','应付工资奖金'],'241','应付职工薪酬'],
    ['1',['4','应付社保费'],'242','应付职工薪酬'],
    ['1',['4','应付公积金'],'243','应付职工薪酬'],
    ['1',['4','应付劳务费'],'244','应付职工薪酬'],
    ['1',['5','应交增值税'],'251','应交税费'],
    ['1',['5','应交城建税'],'252','应交税费'],
    ['1',['5','应交教育费附加'],'253','应交税费'],
    ['1',['5','应交地方教育附加'],'254','应交税费'],
    ['1',['5','应交个税'],'255','应交税费'],
    ['1',['5','应交印花税'],'256','应交税费'],
    ['1',['5','应交所得税'],'257','应交税费'],
    ['1',['6','应付账款'],'261','应付账款']
]

#所有支出类别对应的凭证分录
outcomeVoucherFirst = [
    ['560302—手续费用'],
    ['12210101—临时借出资金'],
    ['22410101—临时借入款'],
    ['151101—投资名称'],
    ['200101—银行贷款'],
    ['560301—利息费用'],
    ['221101—工资奖金'],
    ['22410103—应付社保'],
    ['22410104—应付公积金'],
    ['22410101—临时借入款'],
    ['22210106—销项税额'],
    ['222108—应交城市维护建设税'],
    ['222113—教育费附加'],
    ['222114—地方教育费附加'],
    ['222112—应交个人所得税'],
    ['222118—应交印花税'],
    ['222106—应交所得税'],
    ['220201—单位']

]