#开票：4，普票：1，专票：2 无票：3 税控自开：1，税务代开：2

#记开票公共测试数据
RecordOutputInvoiceCommSelfPublic = [
    ['1','普票','税控自开','内部代表']
]
#记开票-普票-税控自开  测试数据：共10条记录
RecordCommonOutputInvoiceSelfData = [
    [['1','1'],'管理部门','5%','41111','普票-税控自开-商品销售-5%-管理部门41111'],
    [['2','1'],'管理部门','5%','41121','普票-税控自开-服务收入-5%-管理部门41121'],
    [['1','1'],'管理部门','6%','41111','普票-税控自开-商品销售-6%-管理部门41111'],
    [['2','1'],'管理部门','6%','41121','普票-税控自开-服务收入-6%-管理部门41121'],
    [['1','1'],'管理部门','11%','41111','普票-税控自开-商品销售-11%-管理部门41111'],
    [['2','1'],'管理部门','11%','41121','普票-税控自开-服务收入-11%-管理部门41121'],
    [['1','1'],'管理部门','13%','41111','普票-税控自开-商品销售-13%-管理部门41111'],
    [['2','1'],'管理部门','13%','41121','普票-税控自开-服务收入-13%-管理部门41121'],
    [['1','1'],'管理部门','17%','41111','普票-税控自开-商品销售-17%-管理部门41111'],
    [['2','1'],'管理部门','17%','41121','普票-税控自开-服务收入-17%-管理部门41121']
]

#记开票-普票-税务代开 测试数据：共10条记录
RecordCommonOutputInvoiceAgentData = [
    [['1','1'],'管理部门','3%','有形动产租赁','3211','薪资福利-福利费'],
    # [['1','2'],'管理部门','5%','312','薪资福利-劳务费'],
    [['2','1'],'管理部门','3%','运输服务','3221','行政支出-招待费'],
    [['2','2'],'管理部门','3%','电信服务','3222','行政支出-办公费'],
    [['2','3'],'管理部门','3%','建筑安装服务','3223','行政支出-快递费'],
    [['2','4'],'管理部门','3%','金融保险服务','3224','行政支出-通讯费'],
    [['2','5'],'管理部门','3%','其他','3225','行政支出-维修费'],
    [['2','6'],'管理部门','3%','生活服务','3227','行政支出-设备租赁费'],
    [['2','8'],'管理部门','3%','货物及加工，修理修配劳务','3228','行政支出-银行费用'],
    [['3','1'],'管理部门','5%','不动产租赁服务','3231','差旅交通-差旅费'],
    [['3','2'],'管理部门','5%','其他','3232','差旅交通-交通费'],
    [['3','3'],'管理部门','6%','生活服务','3233','差旅交通-汽油费'],
    [['3','4'],'管理部门','6%','金融保险服务','3234','差旅交通-路桥费'],
    [['3','5'],'管理部门','6%','电信服务','3235','差旅交通-汽车维修费'],
    [['3','6'],'管理部门','6%','其他','3236','差旅交通-汽车保险'],
    [['3','7'],'管理部门','11%','其他','3237','差旅交通-物流费'],
    [['4','1'],'管理部门','11%','运输服务','3241','房租物业-房租费'],
    [['4','2'],'管理部门','11%','建筑安装服务','3242','房租物业-物业费'],
    [['4','3'],'管理部门','11%','不动产租赁服务','3243','房租物业-水费'],
    [['4','4'],'管理部门','11%','电信服务','3244','房租物业-电费'],
    [['4','5'],'管理部门','13%','其他','3245','房租物业-仓储费'],
    [['4','6'],'管理部门','17%','其他','3246','房租物业-装修费'],
    [['5','1'],'管理部门','17%','有形动产租赁','3251','经营支出-广告费'],
    [['5','2'],'管理部门','1.5%','其他','3252','经营支出-宣传费'],
    [['5','3'],'管理部门','3%','有形动产租赁','3253','经营支出-研发费'],
    [['5','4'],'管理部门','5%','不动产租赁服务','3254','经营支出-会议费'],
    [['5','5'],'管理部门','5%','不动产租赁服务','3255','经营支出-服务费'],
    [['5','6'],'管理部门','5%','不动产租赁服务','3256','经营支出-咨询费'],
    [['5','7'],'管理部门','5%','不动产租赁服务','3257','经营支出-认证费'],
    [['5','8'],'管理部门','5%','不动产租赁服务','3258','经营支出-专利费'],
    [['5','9'],'管理部门','5%','不动产租赁服务','3259','经营支出-工会经费'],
    [['5','10'],'管理部门','5%','不动产租赁服务','32510','经营支出-其他'],
    # [['6','1'],'管理部门','5%','361','其他收支-行政罚款'],
    # [['6','2'],'管理部门','5%','362','其他收支-税务滞纳金'],
    # [['7','1'],'管理部门','5%','371','税费-印花税'],
    # [['7','2'],'管理部门','5%','372','税费-残保金'],
    # [['7','3'],'管理部门','5%','373','税费-减免税款'],
    [['6','1'],'管理部门','5%','不动产租赁服务','3281','采购-原材料'],
    [['6','2'],'管理部门','5%','不动产租赁服务','3282','采购-商品产品']
]